#Task 2: Configuration
In this section, The configuration process will be done. The logical configuration involves interfaces, inter-vlan routing, DHCP, Routing using RIPV2 and Mail Server configuration. To kick the start of the configuration, We first power on the interface on routers.

#Starting Interface 

#Main Campus Router
By default, the router is shut down for security purposes, to ensure the integrity of the network. To power on router, The following commands will be used.
Router>enable or en – To enable the router
Router# Configure terminal or config t – To change to global configuration mode.
Router(config)# interface Gig0/0 – To start the interface GigabitEthernet0/0
Router(config-if)# No shutdown – To power on the interface.
Router(config-f) # ex – To exit the interface
Router(config)# do wr – To save the configuration

#Clock Rate Configuration
Clock rate configuration is carried on the interface with the serial side which has a clock symbol. This configuration will be done on the Main Campus Router which has both incoming and outgoing interfaces with a clock symbol. The clock rate is important because it ensures that the sender and receiver are synchronized, preventing data interruption and data integrity. Without a clock rate, the timing of the data signal can be mismatched, leading to errors and unreliable communication
Router>en
Router#config t
Router(config) # int se0/1/1 – interface with clock symbol
Router(config-if)# clock rate 64000
Router(config-if) # ex
Router(config) # do wr

#VLAN Configuration
Virtual Local Area Network is a logically subdivided physical network. It allows Network administrators to partition a single physical network into multiple distinct and isolated networks. Each VLAN acts as a single entity even though they share the same network infrastructure. VLAN is important because it segments the network into smaller, sub-isolated networks, meaning that sensitive information can be kept separate from less secure parts of the network. By isolating departments (e.g., finance, HR, and development) into separate VLANs, one can implement stricter access controls, limiting which users or devices can communicate with each other. A total of ten VLANs will be used in the project. We will only demonstrate three VLAN configurations in this work. To con
To configure VLANs, follow this command

1St VLAN( 10) Which will be assigned to the Admin Department

Switch>enable  ------ To enable the switch
Switch#configure terminal ---- Enter global configuration
Switch(config)# int range fa0/1–24  ----- interface range on fastethernet
Switch(config-if)# switchport mode access ---- switch the port to access mode
Switch(config-if)# switchport access vlan 10 ---- creating of vlan and assigning value

2nd VLAN (20) Will be assigned to the HR Department
Switch>enable ------ To enable the switch
Switch#configure terminal ------ Enter global configuration
Switch(config)# int range fa0/1–24 ----- interface range on FastEthernet
Switch(config-if)# switchport mode access ----- switch the port to access mode
Switch(config-if)# switchport access vlan 20 ----- creating of vlan and assigning value

3rd VLAN(30) Will be assigned to the Finance Department
Switch>enable — — To enable the switch
Switch#configure terminal — — -Enter global configuration
Switch(config)# int range fa0/8–10 -— interface range on FastEthernet
Switch(config-if)# switchport mode access — switch the port to access mode
Switch(config-if)# switchport access vlan 30 — creating of vlan and assigning value
Switch(config-if)# exit — exit the interface
Switch(config)# do write — — To save the configuration.

Note: The same process can be repeated for all VLANs. Importantly, VLAN configuration must also be done on the Layer 3 switches because these switches handle routing between VLANs. The Layer 3 switch needs to understand the source VLAN of the incoming traffic to route it correctly. Refer to the next command for further details.

Swicth>en
Switch#config t
Switch(config) # int gig1/0/2
Switch(config-if)# switchport mode access 
Switch(config-if) # switchport access vlan 10
Switch(config-if)# do wr

For connection to be successful between the host in Main Campus and Branch Campus, the interface taking communication from the Layer 3 switch will be configured as a trunk port.

In networking, a trunk refers to a communication channel or link that carries multiple VLANs between switches, routers, or other network devices. Trunks are essential for enabling communication between devices in different VLANs and are commonly used in larger networks where VLAN segmentation is implemented.

#Trunk Configuration
switch>en or enable ----- Both can work perfectly well
switch# configure terminal or config t ------ The two phrases perform the same functions.
switch(config) #int fa0/1 ----- initiate the interface FasthEthenet, which is the gateway interface
Switch(config)# switchport trunk encapsulation dot1q
switch(config-if)# switchport mode trunk ----- trunk mode is activated and assigned to Fa0/1
switch(config-if)# ex or exit
switch(config)# do wr or do write
Note: The same process can be carried out on the Branch Layer 3 switch.
iii.	Assigning IP Addresses To The Interface on The Router
We have discussed in our previous project how subnetting is done. A link will be provided to have a look at it.

#MAIN Campus Router
The main router has two networks connected to its interface. The network is 10.10.10.0 and 10.10.10.4 with a Subnet mask of 255.255.255.252 (Class A) address. Interface Se0/1/1 will have 10.10.10.1 assigned and interface Se0/1/0 will take 10.10.10.5. Let's demonstrate how it's been done. Command below:
Router>en
Router#config t
Router(config) # int Se0/1/0
Router(config-if) # ip address 10.10.10.5 255.255.255.252 – Add IP and Subnet mask
Router(config-if # ex
Router(config) # int  Se0/1/1
Router(config-if) # ip address 10.10.10.1 255.255.255.252 – Add IP and Subnet mask
Router(config-if) # do wr
Branch Router
The branch router has one network attached to its interface. The network is 10.10.10.0 with a subnet mask of 255.255.255.252
Router>en
Router#config t
Router(config) # int Se0/2/0
Router(config-if) # ip address 10.10.10.2 255.255.255.252 – Add IP and Subnet mask
Router(config-if) # do wr

#Cloud Router
The cloud router has two networks attached to its interfaces. Network 20.0.0.0 and 10.10.10.4 with a subnet mask of 255.255.255.252 respectively.
Router>en
Router#config t
Router(config) # int Se0/1/0
Router(config-if) # ip address 10.10.10.6 255.255.255.252 – Add IP and Subnet mask
Router(config-if # ex
Router(config) # int  gig0/0
Router(config-if) # ip address 20.0.0.1 255.255.255.252 – Add IP and Subnet mask
Router(config-if) # do wr
Inter-VLAN routing configuration
This process involves assigning VLAN to the default gateway (10, 20, and 30)
Router(config) int g0/0.10
Router(config-subif) # encapsulation dot1q 10
Router(config-subif) # ip add 192.168.1.1 255.255.255.0 — the first ip address of the first subnet will be assigned to the interface
Router(config-subif) #exit
Router(config) int g0/0.20
Router(config-subif) # encapsulation dot1q 20
Router(config-subif) # ip add 192.168.2.1 255.255.255.0 — the first ip address of the second subnet will be assigned to this interface
Router(config-subif) #exit
Router(config) int g0/0.30
Router(config-subif) # encapsulation dot1q 30
Router(config-subif) # ip add 192.168.3.1  255.255.255.0 — the first IP address of the third subnet will be assigned to this interface
Router(config-subif) #exit
Router(config) # do wr
Router(config) int g0/0.40
Router(config-subif) # encapsulation dot1q 40
Router(config-subif) # ip add 192.168.4.1  255.255.255.0 — the first IP address of the third subnet will be assigned to this interface
Router(config-subif) #exit
Router(config) # do wr
Router(config) int g0/0.50
Router(config-subif) # encapsulation dot1q 50
Router(config-subif) # ip add 192.168.5.1  255.255.255.0 — the first IP address of the third subnet will be assigned to this interface
Router(config-subif) #exit
Router(config) # do wr
Router(config) int g0/0.60
Router(config-subif) # encapsulation dot1q 60
Router(config-subif) # ip add 192.168.6.1  255.255.255.0 — the first IP address of the third subnet will be assigned to this interface
Router(config-subif) #exit
Router(config) # do wr
Router(config) int g0/0.70
Router(config-subif) # encapsulation dot1q 70
Router(config-subif) # ip add 192.168.7.1  255.255.255.0 — the first IP address of the third subnet will be assigned to this interface
Router(config-subif) #exit
Router(config) # do wr
Router(config) int g0/0.80
Router(config-subif) # encapsulation dot1q 80
Router(config-subif) # ip add 192.168.8.1  255.255.255.0 — the first IP address of the third subnet will be assigned to this interface
Router(config-subif) #exit
Router(config) # do wr

#Branch Campus Router
Router(config) int g0/0.90
Router(config-subif) # encapsulation dot1q 90
Router(config-subif) # ip add 192.168.9.1 255.255.255.0 — the first ip address of the first subnet will be assigned to the interface
Router(config-subif) #exit
Router(config) int g0/0.100
Router(config-subif) # encapsulation dot1q 100
Router(config-subif) # ip add 192.168.10.1 255.255.255.0 — the first ip address of the second subnet will be assigned to this interface
Router(config-subif) #exit

#DHCP Server Configuration
As requested in the case study, the device will obtain IP automatically, and DHCP service must be enabled and configured on the router.  The following command is used to configure dhcp server to allocate IP to device dynamically.	
Router>enable or en
Router#config t or configure terminal
Router(config)# service dhcp — Enable DHCP service
Router(dhcp-config)# ip dhcp pool Admin-Pool --- This command creates a pool for Admin where an IP address can be assigned to a device automatically once it is connected.
Router(dhcp-config)# network 192.168.1.0 255.255.255.192 --- The network ID of VLAN 10
Router(dhcp-config)# default-router 192.168.1.1 ---- Default gateway address of VLAN 10
Router(dhcp-config)# dns-server 192.168.1.1---- any IP can be assigned on a dns server.
Router(dhcp-config)# domain-name admin.com ---- assigning a domain name (Not compulsory)
Router(dhcp-config)# exit
Router(dhcp-config)# ip dhcp pool HR --- This command creates a pool for the finance department where an IP address can be assigned to a device automatically once it is connected.
Router(dhcp-config)# network 192.168.2.0  255.255.255.0---- The network ID of VLAN 20
Router(dhcp-config)# default-router 192.168.2.1 ---- Default gateway address of VLAN 10
Router(dhcp-config)# dns-server 192.168.2.1 --- any IP can be assigned on a dns server.
Router(dhcp-config)# domain-name finance.com ---- assigning a domain name (Not compulsory)
Router(dhcp-config)# exit
Router(dhcp-config)# ip dhcp pool Finance — — This command creates a pool for Admin/IT department where an IP address can be assigned to a device automatically once it is connected.
Router(dhcp-config)# network 192.168.3.0 255.255.255.0— — The network ID of VLAN 30
Router(dhcp-config)# default-router 192.168.3.1 — — Default gateway address of VLAN 30
Router(dhcp-config)# dns-server 192.168.3.1 — any IP can be assigned on a dns server.
Router(dhcp-config)# domain-name csr.com — — assigning a domain name (Not compulsory)
Router(dhcp-config)# exit
Router(config)# do wr

Note: The same process will be done for all the networks.
v.	Routing Using RIPV2
Routing Information Protocol Version 2 (RIPv2) is a dynamic routing protocol used to facilitate the exchange of routing information within a network. The following process will be used to configure routing.

#Main Campus Router Routing
Router>en
Router#config t
Router(config)# router rip
Router(config)# version 2
Router(config)#  network 192.168.1.0
Router(config)#  network 192.168.2.0
Router(config)#  network 192.168.3.0
Router(config)#  network 192.168.4.0
Router(config)#  network 192.168.5.0
Router(config)#  network 192.168.6.0
Router(config)#  network 192.168.7.0
Router(config)#  network 192.168.8.0
Router(config)#  network 10.10.10.0
Router(config)#  network 10.10.10.4
Router(config)#  do wr

#Branch Campus Router Routing
Router>en
Router#config t
Router(config)# router rip
Router(config)# version 2
Router(config)#  network 192.168.9.0
Router(config)#  network 192.168.10.0
Router(config)#  network 10.10.10.0
Router(config) # do wr

#Cloud Router Routing
Router>en
Router#config t
Router(config)# router rip
Router(config)# version 2
Router(config)#  network 20.0.0.0
Router(config)#  network 10.10.10.4
Router(config)#  network 10.10.10.0
Router(config) # do wr

#How the Device Obtained IP Automatically
To help understand the process, We document the steps to get IP assigned to the device through image illustration.
Step 1: Click on the PC
Step 2: Click Desktop once it opens, as shown in the image
Step 3: Click on IP Configuration
Step 4: Click on DHCP to request an IP
Step 5: IP Obtained Successfully

#SSH Configuration
SSH is a network protocol that allows secure remote login from one device to another. The importance of ssh configuration is to enhance security by encrypting the management of traffic which includes administrators command and router response.

Router>en
Router#config t
Router(config)# hostname Main – To set hostname
Main (config)# ip domain-name Bsc.com – To set up domain name
Main(config)#  crypto key generate rsa – To generate RSA keys
Main (config)#  username admin privilege 15 secret pass – To set username and password
Main(config) # line vty 0 4 – To enable ssh on vty lines
Main(config) # login local
Main(config) # transport input ssh
Main(config) # ip ssh version 2 – To initiate SSH version 2
Main(config) # service password-encryption – To encrypt password
Main(config) # enable secret pass
Main(config) # ex
Main(config) # do wr

#Verify SSH Configuration
Router# show IP ssh

#Testing SSH Connection
The image shows the SSH connection is working. It shows that without the right credentials, the remote users will be denied access to the device. This is an extra layer of security to protect network devices. The connection was tested from PC4 to the remote system with IP address 192.168.3.1 which is the default gateway of the Finance network.

#Mail Server Configuration
•	Open the server
•	Click service >domain(example.com)
•	Click set
•	Add a user of your choice
•	Username: student, Password: Pass

#Setup Email on User's PC
•	Click Desktop
•	Click Email
•	Enter user information created on the server

#Server Information
•	Incoming Mail Server: The server IP address
•	Outgoing Mail Server: The server IP address
